{"/blog":{"title":"Blog","view":"blog","text":"hey","name":"blog","path":"/content/blog","url":"/blog","files":{},"pages":{"2013-06-experiements-in-kindness":{"name":"2013-06-experiements-in-kindness","path":"/content/blog/2013-06-experiements-in-kindness","url":"/blog/2013-06-experiements-in-kindness","source":"/content/blog/2013-06-experiements-in-kindness"},"2013-escape-south-africa":{"name":"2013-escape-south-africa","path":"/content/blog/2013-escape-south-africa","url":"/blog/2013-escape-south-africa","source":"/content/blog/2013-escape-south-africa"},"2014-03-reed-college":{"name":"2014-03-reed-college","path":"/content/blog/2014-03-reed-college","url":"/blog/2014-03-reed-college","source":"/content/blog/2014-03-reed-college"},"2014-06-early-retirement":{"name":"2014-06-early-retirement","path":"/content/blog/2014-06-early-retirement","url":"/blog/2014-06-early-retirement","source":"/content/blog/2014-06-early-retirement"},"2016-03-23-user-friendly":{"name":"2016-03-23-user-friendly","path":"/content/blog/2016-03-23-user-friendly","url":"/blog/2016-03-23-user-friendly","source":"/content/blog/2016-03-23-user-friendly"},"2016-03-24-data-platform":{"name":"2016-03-24-data-platform","path":"/content/blog/2016-03-24-data-platform","url":"/blog/2016-03-24-data-platform","source":"/content/blog/2016-03-24-data-platform"},"2016-04-27-pdx-open-data":{"name":"2016-04-27-pdx-open-data","path":"/content/blog/2016-04-27-pdx-open-data","url":"/blog/2016-04-27-pdx-open-data","source":"/content/blog/2016-04-27-pdx-open-data"},"2017-08-25-jhand-space":{"name":"2017-08-25-jhand-space","path":"/content/blog/2017-08-25-jhand-space","url":"/blog/2017-08-25-jhand-space","source":"/content/blog/2017-08-25-jhand-space"},"2017-09-14-decentralized-social":{"name":"2017-09-14-decentralized-social","path":"/content/blog/2017-09-14-decentralized-social","url":"/blog/2017-09-14-decentralized-social","source":"/content/blog/2017-09-14-decentralized-social"},"2017-09-15-business-thinking":{"name":"2017-09-15-business-thinking","path":"/content/blog/2017-09-15-business-thinking","url":"/blog/2017-09-15-business-thinking","source":"/content/blog/2017-09-15-business-thinking"},"2017-09-15-human-tech":{"name":"2017-09-15-human-tech","path":"/content/blog/2017-09-15-human-tech","url":"/blog/2017-09-15-human-tech","source":"/content/blog/2017-09-15-human-tech"},"decision-making":{"name":"decision-making","path":"/content/blog/decision-making","url":"/blog/decision-making","source":"/content/blog/decision-making"},"open-source-licensing":{"name":"open-source-licensing","path":"/content/blog/open-source-licensing","url":"/blog/open-source-licensing","source":"/content/blog/open-source-licensing"},"open-source-licensing-part2":{"name":"open-source-licensing-part2","path":"/content/blog/open-source-licensing-part2","url":"/blog/open-source-licensing-part2","source":"/content/blog/open-source-licensing-part2"}}},"/blog/2013-06-experiements-in-kindness":{"title":"Experiments in Kindness","date":"2013-06-01","visible":true,"view":"entry","text":"On June 29th 2011, one week and one day after turning 24, I set out on a mission. The mission: make some yummy chocolate chip cookies. Something about [making chocolate chip cookies](/cookies/) always strikes the right notes with me. When I bake my soul is at ease. Me and the cookies are one. I am not sure what it is; part science, part chocolate, lots of sugar, and of course, smiles. People love cookies and I love making people smile.\n\nAfter I had lots of cookies, I needed someone to eat them. Deciding to give them to cyclists heading home from work was the easy part. The real inspiration struck me while reading about the ongoing conflict in Ladd's Circle. And so my first Experiment in Kindness was born. You can see [the lab notes here](https://github.com/joehand/smilingjoe/blob/gh-pages/experiments/_posts/2011-06-30-freecookies.markdown).\n\nThe response of the complete strangers receiving cookies amazed me. I cannot remember a better bike ride than the one returning home after that experience. It did not take long for me to launch [smilingjoe.com](http://smilingjoe.com) and make it a goal to keep my experiments going. The experiment was also featured [on the local bike blog](https://bikeportland.org/2011/07/01/solution-for-ladd-circle-stop-sign-issue-cookies-55819), BikePortland.\n\nKindness begets kindness. We can each make the world a better place with kindnesses small or large. Even if my experiments fail or stop completely, I know that for that one day, in those 30 minutes, I put smiles on 100 faces and that is enough.\n\n> The day always looks brighter from behind a smile.","name":"2013-06-experiements-in-kindness","path":"/content/blog/2013-06-experiements-in-kindness","url":"/blog/2013-06-experiements-in-kindness","files":{},"pages":{}},"/blog/2013-escape-south-africa":{"title":"Escape from South Africa","date":"2013-06-30","visible":true,"view":"entry","text":"### How to travel with your sister’s passport, and the flu\n\nSweat dripping and the hum of the fluorescents made for a soothing combination of sounds, but I was focusing on something else. Two immigration officers were in the next room discussing my passport, or perhaps it was my sister’s? I listened, but I could not understand.\n\nI sat in a dank room, walls grim, worn carpet, and cheap chairs. Federal offices all over the world must order from the same catalog. Another gentlemen from an undisclosed country waited with me. I sat wiping sweat off my brow, he paced. Was this a nightmare? Fevered hallucinations? No, this was my attempted escape from the Johannesburg airport.\n\nYes, I had flu but was I really that compromised? Scenarios ran through my head. It was useless. My exit out of South Africa sat in the hands of the portly officer.\n\n---\n\nFourteen days prior I blissfully boarded my plane from Frankfurt to Johannesburg. I was heading to Africa for the first time. My mind full of anticipation, wonder, and excitement.\n\nTen hours later I am preparing for my way through immigration, someone will scan my passport.\n\nYou see, my passport has two odd features I discovered right before my trip. First, my picture is from when I was fifteen. I have long hair. Oh, and I could easily be mistaken for a girl. Look closely and you may recognize me. But there’s something else…\n\n**The gender on my passport says female.**\n\n![Notice the “F” under Sex](https://cdn-images-1.medium.com/max/3752/0*XwOJlQ-ErrMahIvQ.jpeg)\n*Notice the “F” under Sex*\n\n## Sneaking into South Africa\n\nThe line for entering South Africa is long and painful. After two ten hour sleepless flights I am exhausted. Rather than try to explain my gender situation I decide to feign ignorance. Two passport checks in Germany were no problem.\n\nI hand the immigration officer my passport and I wait, nervously. First she questions the picture. I try to explain, I’ve changed, I was young then, fifteen. She looks at gender inquisitively. She asks, and what is your gender?\n\nI’m male, of course. Unfortunately, my passport does not say male. The officer asks, “Why do you have your sister’s passport?” I act confused. She kindly points out the error and I am aghast.\n\nI’ve never been good at acting. She directs me to sit in the corner, dunce cap on while waiting for the supervisor, clocks tick.\n\nMy passport makes rounds. The supervisor asks fellow officers if the person in the picture is male or female. They ask me why I have my sisters passport. My confidence is shaky. I am not sure if I will ever touch the soil of South africa.\n\nI present my drivers license, I feel a hint of encouragement. I explain that I am here for work and am presenting the next day. After more discussion and a scolding for having a ten year old passport that incorrectly identifies me as a girl, they reluctantly let me in, phew.\n\n---\n\n## Judgement Day\n\nMy journey home is filled with anxiety. I worry again about my passport, whether I will be able to get home. I know they have stricter immigration checks than most other countries. I never imagined what was ahead for me.\n\nI leave Cape Town with a sore throat, a runny nose, and a slight fever. I arrive in Johannesburg with a terrible fever and stomach ache, barely able to utter a word. With a few hours before my connection I must find medicine.\n\nLuckily the first store after getting off the plane was a full-fledged pharmacy. After trying to navigate the mostly-Afrikaans labeled medicine I get in line for the pharmacist. The gentleman in front of me explains his daughters symptoms, they are exactly what I am feeling. I buy the same medicine and walk out with relief.\n\nAfter visiting the restroom and taking my medicine I start making my way to my gate. I begin sweating as I schlepp my bags through the airport. As I get closer and closer I realized I have to go through security again.\n\nI’m confident, South African airport security seems relaxed. I prepare my bags, chug my water, and get in line. As I get closer I see another line after security, passport control.\n\nI hoped the passport control was casual, similar to Germany. They scrutinize your passport getting into a country, I never imagined it would be hard to get out of a country.\n\nAs I joined the queue I realized this could be the beginning of my nightmare. And it came earlier than expected. The line crawls. And it wasn’t for a lack of people checking passports.\n\nWhile waiting in line I survey the immigration officers. I tried to find a reasonable one. I rule out one, he looks terrifying.\n\nI drew him, of course! I presented my passport, damp with perspiration. His eyes set on the passport then he looks up at me. And again. And again. UP, down, up , down.Then comes the question I never expected.\n\n> ### “This is not your passport. Where is your passport?”\n\nI’m dead silent. I nervously point out that my picture is old and I am a male even though it says female. I try to explain that it is mine. He quickly calls someone else over and says something I don’t understand. I am pulled aside and he tells me to go with him. Oh no.\n\nWeighted with luggage and sweat I struggle to keep up with my leader. We wander through the terminal, seemingly endless, before exiting through a side door. After an enduring set of stairs, locked doors with fingerprint security, and several long poorly lit hallways we end up in the requisite federal waiting room. My passport and ticket are ripped from my hands.\n\nI’m drenched. The passport draws a furious discussion between officers as they study the picture. One officer pokes her head in to get a closer look. The other sketchy-passport refugee joins me and begins pacing. Finally, I am summed to the supervisors office.\n\nI am grilled on the details of my passport: why did you not correct your passport, what are you doing in South Africa, where are you going? I try to explain my situation. I present my license and offer my full wallet for evidence. He stays quiet but keeps shaking his head.\n\nHe’s holding my ticket. I have ten minutes until boarding closes. After some hesitation he calls in his colleague to escort me back to the original passport control. I breath a silent sigh of relief, hoping this means freedom.\n\nOnce we start moving the officer asks me which line I came from. We are in the caverns of this airport. So many stairs, and hallways, passing doors, and I have a terrible fever. I am lost. I declare my utter state of delirium.\n\nWe are back in the main terminal. He asks again “Don’t you remember what line you were in?” Finally, I get my bearings and we make our way back.\n\nAs we approach the officer who originally sent me away, my nerves return. I go through the same process showing him my license, explaining my situation, and perspiring. It’s clear he does not want to let me through but knows his supervisor approved it. He writes down all of my information, looks at my ticket and tells me to run, fast!\n\nI give a quick thanks and start running. Running away. Running toward freedom, at least temporary freedom. All I want to do is sit, have some water, and sleep.\n\nI’m running for what seems like miles. I break and realize I am departing from the furthest gate. I keep running and running, catching my breath, resting on the electric sidewalk , and then my last sprint to the end.\n\nI see the gate, the door is still open. I made it. Coughing and winded but with a lighter heart I hand my boarding ticket and passport to the gate attendant. And then the question comes.\n\n> “Are you sure this is you?”\n\nTrying to stay composed I tell her I have changed a lot in the last ten year. She laughs and tells me I have really grown into a man and motions me onto the plane. I made it. I made it. I made it.\n\n---\n\n## Home Sweet Home\n\nDuring the plane ride I pass through three mental states: sleep, feverous delusion, and distress about getting through Germany and into the US.\n\nI find luck in Germany by missing any of the passport control stations. I enjoy my connection there like no other flight connection I have ever had. I feel like the king of the world, free to move about Terminal 1-Z doing whatever I please.\n\n![](https://cdn-images-1.medium.com/max/6528/0*yz0zMb9xzx6bQlI4.jpeg)\n\nMy tranquil state carries over for most of the flight to the US. I get to fly one of the double-decker Airbus planes for the first time. I enjoy my last moments of freedom. We are handed the US customs forms and the hammer of reality drops.\n\nOnce again, in the passport line and my mind is racing. What do I say? How do I tell them it is really me? I decide to be my true self and explain my situation honestly.\n\nI approach the US immigration officer, no expectations. I hand him my passport, explaining my situation. There is an error on my passport. I found out about it right before my trip, I did not have time to change it. The picture is from many years ago. I had long hair, and yes, And don’t worry, I submitted the application for an error correction today. I have a drivers license if that helps. I am not sure what to do, I barely got out of South Africa.\n\nHe stays silent. He looks at me, looks at my passport, scans the passport, and examines my drivers license. And finally he speaks.\n\n> ### “Are you sure you didn’t get a gender change operation on the plane?”\n\nDeep, uncontrollable laughter releases days worth of tension, I tell him no, I have always been a male. Contrary to all expectations he explains how I can get my passport fixed and that I can probably get a new longer expiration time out of it for free. Then he stamps my customs document and sends me on my way. The relief is palatable.\n\nThe rest of the journey home has its hiccups but I know I can get there. It may be painful, full of delays, bloody noses, and dehydration, but I can make it without worrying about my passport.\n\n---\n\nAnd don’t worry, I submitted the application for an error correction today. No longer will I be flying as my sister. Or a female fifteen year-old male. Or anyone but myself. Because in the end being true to who I am is the best way out of a very sticky situation.","name":"2013-escape-south-africa","path":"/content/blog/2013-escape-south-africa","url":"/blog/2013-escape-south-africa","files":{},"pages":{}},"/blog/2014-03-reed-college":{"title":"The Reed College Experience","date":"2014-05-01","visible":true,"view":"entry","text":"The Reed College experience is often hard to capture. The [latest Reed Magazine](http://www.reed.edu/reed_magazine/june2013/articles/features/oralhistory/oralhistory1.html) has a great history of the Reed experience and how it came to be. At Reed you \"think about thinking\" and learn reasoning by doing. During the process you realize “you are not your ideas, but merely a holder of your ideas.” But this all relies on a open process that does not define a starting and ending point:\n\n> \"If, on some level, we know what the learning system wants from us—say, by the use of grades as feedback on a defined path toward earning a degree to enter a specific career—we can erect certain internal defenses that allow us to choose how much of ourselves we give away to the system. But when the contract with the system is as existential as learning for the sake of learning, and progress is measured more qualitatively than quantitatively, we are apt to lose some of our psychic protections, allowing the system to get more deeply into our heads.\"\n\n[Read more](http://www.reed.edu/reed_magazine/june2013/articles/features/oralhistory/oralhistory1.html)","name":"2014-03-reed-college","path":"/content/blog/2014-03-reed-college","url":"/blog/2014-03-reed-college","files":{},"pages":{}},"/blog/2014-06-early-retirement":{"title":"The Shockingly Simple Math Behind Early Retirement","date":"2014-06-14","visible":true,"view":"entry","text":"There are countless blog posts about how to save for retirement. [In this post](http://www.mrmoneymustache.com/2012/01/13/the-shockingly-simple-math-behind-early-retirement/) Mr. Money Mustache presents an amazingly simple and shockingly effective way to look at retirement; the amount of time until you can retire is simple a function of your savings rate. What doesn't matter? Your income, your spending, your age, or anything else.\n\nNot only is the equation simple, the idea behind it is very powerful. Looking at the table he presents, you can see that by increasing your savings from 10% to 15% you can chop 8 years off your time until retirement. Wow!\n\nThe reason this works? In order to increase your savings rate, you probably have to decrease your spending. This means that you will be able to live off less for the rest of your life. And your money saved will be compounded over time. So, there are some strict assumptions in there. But the idea behind everything is very intriguing, and I suggest you at least [take a look](http://www.mrmoneymustache.com/2012/01/13/the-shockingly-simple-math-behind-early-retirement/).\n\nI just discovered the Mr. Money Mustache site but already it has become an invaluable resource on financial advice for me. It bucks much of the conventional wisdom and focuses on spending less through decreased consumption, an idea that is close to my heart. Not only does it leads to more happiness, it helps our planet as well. [Read away](http://www.mrmoneymustache.com/2013/02/22/getting-rich-from-zero-to-hero-in-one-blog-post/)!","name":"2014-06-early-retirement","path":"/content/blog/2014-06-early-retirement","url":"/blog/2014-06-early-retirement","files":{},"pages":{}},"/blog/2016-03-23-user-friendly":{"title":"The Secret to Creating User Friendly Products","date":"2016-03-23","visible":true,"view":"entry","text":"It was my first time in South Africa. Or Africa at all for that matter. My task was to train a mothers’ group from the Khayelitsha township in Cape Town how to use the prototype data collection tool we were designing for Shack/Slum Dwellers International. I had no business doing this. As a white, American, privileged male with no international experience, I was about as far as you could get from my users living in informal settlements of developing countries worldwide.\n\nIt was a spectacular flop. The first day was training. The second day we were supposed to use these new tools in the field during a community-driven settlement profile. The second day came and the only person using the new tool was me — I gave up half way through. We resorted to pen and paper.\n\nWhen we got back to the US, we didn’t go back to the drawing board. We threw it in the trash. We were supposed to make a tool that could be used in over 30 countries in the Global South in community-driven data collection activities. Different languages. Different technological capacities. Different types of data collection. Different understandings of the word *household*. We couldn’t even get one community group to understand the prototype.\n\n---\n\nCertain technologies and platforms *thrive* on being unfriendly to new users. This may sound strange, but do you remember the first time you used Twitter? Snapchat? Have you ever tried to teach someone your own age how to use Twitter or Snapchat? Have you tried to explain to a parent how they work? What about a grandparent?\n\nTwitter makes absolutely no sense until you use it. Snapchat is successful precisely because it [confuses olds](http://www.bloomberg.com/features/2016-how-snapchat-built-a-business/). These platforms aren’t hard to use once you are in but they make it hard to get in.\n\nUsers like these platforms because there is a price to entry. Once you learn how to use them, you become a part of the club. It’s an initiation ritual. Don’t want to spend the time understanding what a follower is and what a retweet means? Sorry, you don’t belong.\n\nIn these platforms, there is a high amount of friction for new users. Either you overcome this and are rewarded, or you remain an outsider.\n\n---\n\nMost companies take the opposite approach. They want everyone in: Facebook, Apple, Slack (current pinnacle of user friendly). These companies try to get as many people using their tools as possible with minimal resistance.\n\nEven though they make it easy, they still force you to think in a certain way. Try riding a bike in a way it wasn’t designed for. Use your doorknob like it belongs to a sliding door. Use an Apple like it was an Android. Eat an android like it was an apple.\n\nForcing people to think and act in certain ways is the Achilles’ heel of technology (technology in the broadest sense; try using a fiery stick like its a regular stick). Technology cannot be developed without assumptions.\n\nAll tools we create have their own structure and terms of use. New users must learn these peculiarities. This can be an asset (Snapchat, Twitter) or something to minimize. You have to face this hurdle or ignore it at your peril (and without compassion for your users).\n\n---\n\nIn the end, we succeeded in creating a new data collection pipeline for Slum/Shack Dwellers International with lots of awesome work from communities worldwide, [Ona](http://ona.io/), and [Enketo](https://enketo.org/), and partners at SDI.\n\nOver 7,000 communities worldwide have collected and updated their profile data in a year, a feat that previously took over five years. In Accra, Ghana the community and support partners have data on over 4,000 services: whether the service is working, the quality of the service, and who owns and manages the service (perhaps better data than the city government has):\n\n![Informal Settlement Services in Accra (Interface: [Ona.io](https://ona.io), Data: SDI & People’s Dialogue on Human Settlements, Ghana)](https://cdn-images-1.medium.com/max/2314/1*UxzcdBDVA3e14TvnNPORGw.png)\n\n*Informal Settlement Services in Accra (Interface: [Ona.io](https://ona.io), Data: SDI & People’s Dialogue on Human Settlements, Ghana)*\n\n---\n\n## Create a user friendly product by admitting your product isn’t user friendly\n\n1. Minimize new user friction.\n2. Admit that users need to learn new ideas. Users will be uncomfortable at first, that’s okay.\n3. Introduce new concepts, terms, and UI elements slowly. Let users test one function at a time. Guide them through the process but do not force them to move forward. Make sure users can enter or move forward at their own pace.\n4. Allow users to enter at any level of complexity. Give users small and concrete awards for each new hurdle they cross.\n\n---\n\n[Read the details of how we addressed these with SDI](blog/2016-03-24-data-platform/).\n\nEach technology and platform will be different. For another example, look at the writing experience here on Medium.\n\n1. Minimal friction. “Write here” box on the homepage. Once click and users get a text box, a familiar thing.\n2. Admit users will be uncomfortable. Don’t make them “start a new draft.” That sounds like a commitment. Let them write first, explore functionality later.\n3. Add concepts slowly. Want see more features? Go full screen and show formatting tips on the bottom *but don’t force a user through them.*\n4. Instant rewards. Write something and publish. It takes two clicks and some writing to publish content. Awesome.\n\nMedium starts with the most basic functionality (writing) and allows the user to expand their knowledge as they get comfortable.\n\nYour product will not be user friendly. Admit it to yourself. Help your users through the friction. Have compassion for them. Introduce ideas slowly.\n\nEach user needs an entry point. Too simple and they will overlook the tool as too basic. Too complex and they will get frustrated and leave. **Identify the steps of complexity of your technology and make it straightforward to enter at any point on the ladder.**\n\nFinally, make sure they get rewards for their learning & patience.\n\nAnd if you want to build the next Snapchat? Do the opposite of everything above.","name":"2016-03-23-user-friendly","path":"/content/blog/2016-03-23-user-friendly","url":"/blog/2016-03-23-user-friendly","files":{},"pages":{}},"/blog/2016-03-24-data-platform":{"title":"How to Build an International Data Platform","date":"2016-03-24","visible":true,"text":"Creating a user friendly experience is not easy. Especially when you are not the user and don’t know much about the end user.\n\n**If you didn’t see the introduction post**, [check it out here](/blog/2016-03-23-user-friendly/). Here is the short version:\n\nIn order to create a user friendly product, you should:\n\n1. Minimize new user friction.\n2. Admit that users need to learn new ideas to use your product.\n3. Introduce new concepts, terms, and UI elements slowly.\n4. Give users small and concrete awards for each new hurdle they cross.\n5. (In our case) Have awesome and patient users.\n\nWe had our own unique challenges in addressing each of these. But in the end, it was mostly about compassion for our users.\n\n---\n\n### Minimize New User Friction\n\nWe quickly scrapped the mobile-first approach we had prototyped. Everyone is familiar with pen and paper. They won’t get stolen or have dead batteries. They won’t need internet connections to upload data. We started there.\n\n(We still made mobile and tablets an option. Certain users may have more friction with paper than mobile. Paper creates other frictions later.)\n\nWhen users moved to digital, we made it seamless by making the digital form look **exactly** the same as the paper form (huge props here to Martijn van de Rijdt at [Enketo](https://enketo.org/)), including any language or local wording differences.\n\nBy the end, we had communities members that had never touched a computer before collecting and entering data.\n\n### Admit Users Will Be Uncomfortable\n\nWe had to be upfront with our users. People like learning and trying new things, but not to the point of frustration. In our training we had to tell the community this would be hard. They were learning lots of new things. We took breaks. We did fun things on breaks. Most importantly, we always presented something at the end showing the result of their hard work.\n\n### Introduce New Concepts Slowly\n\nGoing from zero technical knowledge to collecting and entering geographic data was a big hurdle. We did not acknowledge this at the first prototype training. Once we failed one time, we had to think about how we could separate these new ideas.\n\nWe started with the basic data collection on paper. No map concepts. No digital devices. Collecting and entering population numbers, community problems, things people lived with in their daily life: numbers and text.\n\nOnce the communities understood what “data” meant, then we moved them to the computer. They were able to enter the data and see how it feels to move from paper to computer. After a form was completely entered, they could print the digital version of their completed form. It looked the exact same as the pen copy but printed ink, more permanent. This also gave reassurance that what had been written on paper was also recorded digitally.\n\nAfter users were comfortable with digital forms we could start introducing geographic concepts by starting with a satellite map of a familiar place, their neighborhood. Whenever there we new concepts we needed to anchor with familiar topics (GIS concepts anchored in the map of their neighborhood). New topics, familiar concepts. Don’t do both at once.\n\nWe had lots of other types of users too. We had NGO GIS professionals. They could dive right into the map tool, a familiar concept, and start exploring similar filtering and mapping tools. We had heavy Excel users. They could create instant reports with common Excel functions from a live database.\n\nEach user needs an entry point. Too simple and they will overlook the tool as too basic. Too complex and they will get frustrated and leave. **Identify the steps of complexity of your technology and make it straightforward to enter at any point on the ladder.**\n\nWe added layer upon layer without requiring everything to be done to see results. Users could see results right away, in whatever domain they were comfortable.\n\n### Give Users Rewards for New Ideas Learned\n\nEvery time a user learns a new concept they should be rewarded. Cement that concept in their mind. Give them a chance to take a break, or go back if they want to relearn.\n\nWe made many types of outputs, from the basic printed digital copy of the form to advanced data views and filters. Each concept should have a rewarding output the user can experience immediately.\n\nIt’s not an accident that the level-up type games are so popular.\n\n### Have Awesome & Patient Users\n\nOf course, none of this could have been done without our community users, partners at Slum/Shack Dwellers International, and developers at Ona and Enketo. Finally, a big thanks to the community members that had amazing patience when I tried to have everyone collect data on mobile phones.","name":"2016-03-24-data-platform","path":"/content/blog/2016-03-24-data-platform","url":"/blog/2016-03-24-data-platform","files":{},"pages":{}},"/blog/2016-04-27-pdx-open-data":{"title":"Why Portland’s Comprehensive Plan Cannot Succeed Without Open Data","date":"2016-04-27","visible":true,"view":"entry","text":"*In respose to [this post by Catherine Nikolovski](https://medium.com/@cat_nikolovski/why-portland-needs-open-data-8267dac0d789)*\n\nDear Mayor and Commissioners,\n\nOpen Data will not be successful unless it is an attitude that permeates the City. The comprehensive plan, and Policy 2.11 unamended, is the ideal place to encourage innovative, open, and transparent partnerships between the City and its communities, which without Open Data will not be possible.\n\nI’ve worked in cities worldwide on Open Data. I’ve helped communities in informal settlements to collect land use data throughout the Global South. This data fosters a culture of transparency and accountability around planning and development. Open Data transforms communities. Through Open Data we increase the accountability of city governments and ultimately improve lives. Unfortunately, better public service data currently exists for slums of Lagos, Nigeria than Portland, Oregon.\n\nThroughout the comprehensive plan, many goals and policies overlap Open Data: intergovernmental coordination (Policy 1.15), community involvement as partnership (Goal 2.A), **transparency and accountability** (Goal 2.D), **strong civic infrastructure** (Goal 2.G), **two-way channels of communication** (Policy 2.8), community participation in data collection (Policy 2.10), **verifying data** (Policy 2.25), **tools for effective participation **(Policy 2.39), small business development (Policy 6.9), **business innovation** (Policy 6.10), sharing economy (Policy 6.11), public service coordination (Policy 8.8), **internal coordination** (Policy 8.9), coordination (Policy 8.46), Vision Zero (Goal 9.A, as amended), **performance measures** (Policy 9.48), and innumerable others. People may not think of these policies and goals as Open Data. But Open Data will help us accomplish them.\n\n**Take Goal 2.D, for example, Transparency and Accountability**. The City makes many land use decisions using data (maps, testimonials, surveys, etc.). In drafting the comprehensive plan, we have seen how data is fundamental to the process. Each of the testimonials, amendments, and zoning changes — these are all data. To make the City transparent and accountable in this process, this data must be public and usable. **Without opening data around land use decisions, the City cannot be transparent. Without sharing data in a format usable by software, communities cannot hold the City accountable.**\n\n### Portland Open Data Part 1\n\nThe first implementation of Open Data for Portland was [CivicApps.org](http://www.civicapps.org/). CivicApps was an innovative way to share public data. Students, technologists, and activists visited CivicApps.org to use Portland data. Users commented from North Carolina, Massachusetts, and even France.\n\nUnfortunately, we can also look at CivicApps to see what Open Data is not. The data is stale. It was last updated since 2014. Most of the communication was one-way, the City rarely responded to comments. If users found errors, there was no way to correct them.\n\nOpen Data will help the City be transparent and accountable. It will encourage tools for effective participation. Open Data can create two-way channels of communication and improve internal coordination. To do these, we need to understand Open Data as a process, not a one-time and one-way publication of data.\n\n### Vision Zero and Open Data\n\nWe can look at Vision Zero to help understand what Open Data means. At first, the idea of needing a Vision Zero policy may seem frivolous. *Of course, *you may say*, the City does not design roads, set transportation policy, or set enforcement priorities with the goal of **increasing** traffic fatalities. *But then, why do we need Vision Zero?\n\nWe need Vision Zero to articulate our priorities within transportation policies and practices. A transportation engineer does not design a street to kill people, but it happens. Vision Zero prompts an engineer to think “how may this design result in a fatality?”, where she otherwise may not. Vision Zero requires “a comprehensive approach”, “a strategic planning effort”, and “collaboration from a wide range of partners”. Vision Zero is a process. It cannot be successful unless every person within our transportation system absorbs the mentality.\n\nThe amended Open Data policy, amendment P11, reads:\n\n> “**Where appropriate**, encourage publication, accessibility and wide-spread sharing of data collected and generated by the City.”\n\nCan you imagine if our Vision Zero goal was similarly worded?\n\n> “**Where appropriate**, encourage planners and engineers to design roads that minimize fatalities on roads maintained by the City.”\n\nWe could not achieve Vision Zero by trying to reduce fatalities ***where appropriate. ***We’ve experienced this over the last several decades and seen how it has failed our community. It is misguided to expect the same for Open Data. Open Data is not a one-time initiative. It is an ethos the City must adopt, one of transparency, openness, and accountability.\n\nThough it may seem foolish to compare Open Data to Vision Zero, Open Data can improve and even save lives. Digital tools will be as important as physical infrastructure in 2035, when this comprehensive plan expires. We will not succeed by setting our targets low, publishing data only ***where appropriate.***\n\nThere are already cities partnering with technology companies using Open Data to accomplish Vision Zero, Portland could be next.\n\n### Transparency and Accountability\n\nTwo stated goals of the comprehensive plan, transparency and accountability, keep appearing. These two ideas encompass Open Data.\n\nTransparency is publishing all information used in land use and planning decisions. This includes source data, maps, databases, and community feedback or public commentary. The City is already accomplishing a lot around transparency. We’ve experienced this transparency during the comprehensive plan update. But Open Data is not just publishing data, that is only half of it. Open Data is a conversation, a partnership.\n\nAccountability is the harder part of Open Data. There are two sides to accountability in Open Data. Most importantly, the city must release data in a way the community can use it, analogous to how the City used it. Citizens must be able to use similar tools as the City to hold them accountable. This requires data released in a timely, machine-readable, and documented manner.\n\nImagine I send the IRS my income data in a language of my own invention. This would prevent them from calculating my taxes. How could I expect them to hold me accountable for my taxes? I wouldn’t (and I could expect an audit later). If the City shares data in proprietary or non-machine readable formats, the citizens are hamstrung in holding the City accountable.\n\nSecondly, the City must have mechanisms to respond to citizen feedback from that data. This feedback could include errors in the data, a contention with data analysis results, or general comments. Open Data is a two-way street where the City provides transparent information and citizens provide accountability.\n\nOpen Data must be a ubiquitous goal, not something done after-the-fact, when appropriate, and as a one-way distribution.\n\n### Portland Open Data Part 2\n\nMayor and commissioners, we all strive for a transparent and accountable City. We want to foster increased community participation, better civic infrastructure, and improved internal coordination. We need to save lives and achieve Vision Zero. None of this can happen without Open Data.\n\nCitizens, non-profits, small businesses, and advocates need access to public data. The City uses data to make land use and planning decisions and communities should be able to do the same. We want to use this data to create tools for community participation, to understand traffic fatalities, and to hold government officials accountable. Open Data can help communities improve equity, deepen our understanding of underrepresented groups, and learn new ways to love Portland.\n\nPlease retain Policy 2.11, the Open Data policy, as originally drafted.\n\nSincerely,\n\nJoe Hand","name":"2016-04-27-pdx-open-data","path":"/content/blog/2016-04-27-pdx-open-data","url":"/blog/2016-04-27-pdx-open-data","files":{},"pages":{}},"/blog/2017-08-25-jhand-space":{"title":"A new space for writing & experiments","date":"2017-09-14","visible":true,"view":"entry","text":"Welcome to jhand.space! This is my new place for experimentation, fun, and writing. You can check out some of my old stuff at [joeahand.com](https://joeahand.com/) too.\n\n[Enoki](https://github.com/jondashkyle/enoki), used to build this site, caught my eye when it was first published. The development experience is well thought out. It is capable of building powerful static sites while keeping things simple. Most importantly, the file-based structure has awesome implications for publishing on the peer-to-peer web.\n\nSince all the content is file-based, it will allow us to decentralize site publishing from content creation. I could write a generic front-end blog template. Then *anyone* can plugin their content into my template to create a static site. This is Wordpress theming that allows combinations of any front-end logic with any content, all up to your imagination. But it keeps all the content local on your computer (and backup up anywhere over the Dat network). Very exciting.\n\nAlong with Enoki, I got to use a couple other technologies I am loving:\n\n* [Choo](https://github.com/choojs/choo) - frontend JS framework that is actually fun to use.\n* [Tachyons](http://tachyons.io/) - we all know CSS is the most important part of a site, and Tachyons does it right.\n* [fair analytics](https://github.com/vesparny/fair-analytics) - web tracking without stealing your privacy! Keep it fair for everyone.\n\nReally looking forward to how this develops! Keep an eye out for more posts and experiments.","name":"2017-08-25-jhand-space","path":"/content/blog/2017-08-25-jhand-space","url":"/blog/2017-08-25-jhand-space","files":{},"pages":{}},"/blog/2017-09-14-decentralized-social":{"title":"Decentralized Social Networks are a Human Problem","visible":true,"date":"2017-09-14","view":"entry","text":"Researchers at the MIT media lab have looking at decentralized technology lately. They published an extensive report on [the decentralized web](http://dci.mit.edu/decentralizedweb) covering existing technologies, their benefits and shortcomings.\n\nAs someone working on decentralized technology it's been a great resource. Unfortunately Beaker Browser, a peer-to-peer web browser powered by Dat, is not included in the research (the research was funded by the Knight Foundation, one of the main funders for Dat). Dat has not marketed around the decentralized web capabilities, something we are changing soon. And part of me is a bit happy Dat is not be lumped in with the technologies studied. We are the only nonprofit developing decentralized web tools and we hope to do things differently. Less marketing, less hype, just trying to make public infrastructure for a better future.\n\nRecently, they published an [opinion piece in Wired](https://www.wired.com/story/decentralized-social-networks-sound-great-too-bad-theyll-never-work/) identifying all the reasons decentralized social networks will never work. There are some good reasons in there, but the main thing that struck me was that all the concerns are *human-driven*, not *technological* shortcomings.\n\nThe arguments against decentralized platforms fall under these issues:\n\n1. \"these tools will face challenges acquiring users and gaining the attention of developers\" - because of network effects and bad user interfaces.\n2. \"These platforms also pose new security threats\" - because of lack of real-world identities and confusing public key cryptography\n3. \"Designing robust reward mechanisms to curate content that keeps people informed rather than entertained remains a problem.\" - and these curation tools are expensive.\n4. \"platforms benefit from economies of scale\" (both technological and social) - storage/bandwidth are cheaper at scale and social network effects make platforms more useful.\n\nAll of these issues are either solved technological problems, or human/social issues. To say that decentralized social networks will never work is to admit the technical problems will overshadow the human problems.\n\n> The reality is that most people do not want to run their own web servers or social network nodes. They want to engage with the web through friendlier platforms, and these platforms will be constrained by the same forces that drive consolidation today.\n\nThis is the root of the issue. This assumes that running servers or nodes is a prerequisite to decentralized social networks (it is not). This assumes that our public spaces and private spaces need to all exist in the same platform - and that the platform *must* be consolidated, thus centralized. The problem is that we think of Facebook, Twitter as the *platform*. And to succeed as such a platform, it must be a monopoly, which is the case. But, isn't it the web that is the platform?\n\n> A better strategy would be to pursue policies that strengthen the environment for decentralized platforms, including data portability, interoperability, and alternatives to advertising-based funding models.\n>\n> Decentralized web advocates have good intentions, but there’s no silver-bullet technical solution for the challenges that lie ahead.\n\n...\n\n> The platforms that host and inform our networked public sphere are unelected, unaccountable, and often impossible to audit or oversee.\n\nThese arguments all make the assumption that online public spaces must be privately owned and funded. This limits revenue sources to a few basic sources: ads, selling user data, or subscriptions. This assumption is correct in our current political environment but discounting other possibilities is why this restriction could fail in the future.\n\n> ... highlights the ever-expanding ways in which we now rely on large private platforms to facilitate our online activities.\n\nThe core issue here is that we are relying on private enterprises to run our public online spaces. Nowhere is it mentioned that maybe, perhaps, some of these private platforms need to be public spaces. Real life and online life are now inseparable. Why do we keep forcing our public lives to be managed by private companies? Just as starting public libraries would not be viable in the current political atmosphere, starting public online spaces is not even considered.\n\nThere are still a lot of questions about what a public online space means. But to fully disregarding that possibility continues to lead us to a path of relying on private companies to live life online.","name":"2017-09-14-decentralized-social","path":"/content/blog/2017-09-14-decentralized-social","url":"/blog/2017-09-14-decentralized-social","files":{},"pages":{}},"/blog/2017-09-15-business-thinking":{"title":"Resources for Thoughtful Technology Businesses","visible":true,"date":"2017-09-15","view":"entry","text":"In the last few months I've been thinking and reading a lot about starting and funding thoughtful technology businesses. You can see my [book list](/book-shelf) for books on traditional business and marketing resources. But at Dat Project, we aren't seeking to just start a regular business. To learn more I've been looking at awesome examples of thoughtful, modern, tech-driven businesses.\n\nThere have been some resources I keep going back to. As we share more about our nonprofit, Code for Science & Society, you'll see some themes emerging. A lot of that is driven by the writing and ideas from these amazing people. I'll keep this list updated and we continue to learn more.\n\n## Funding Open Source - Nadia Eghbal\n\nWhen starting a new business the first thing you need to decide is how to fund it. *In this case, I separate business from project. A project is something you can start with your extra time. A business is exists to be about more than you. We've started to make that shift with Dat.*\n\nBut funding can be hard and confusing!\n\n* [Roads and Bridges: The Unseen Labor Behind Our Digital Infrastructure](https://www.fordfoundation.org/library/reports-and-studies/roads-and-bridges-the-unseen-labor-behind-our-digital-infrastructure/) - Great report on the current state of funding open source software work.\n* [A handy guide to financial support for open source\n](https://github.com/nayafia/lemonade-stand)\n* Find more from the awesome [Nadia Eghbal](https://twitter.com/nayafia)\n\n## Zebra Startups - Mara Zepada\n\n* [Zebras Fix What Unicorns Break](https://medium.com/@sexandstartups/zebrasfix-c467e55f9d96)\n* [Zebras Unite](https://www.zebrasunite.com/)\n* [Follow Mara](https://twitter.com/marazepeda) (and other Sex & Startups people) to learn more\n\n## Humane Tech & Glitch - Anil Dash\n\n\n* https://medium.com/humane-tech/toward-humane-tech-23a20405681a\n* https://medium.com/humane-tech\n\n\n## Other Nonprofit Tech Stuff\n\nRandom examples, resources, other cool companies we are looking towards for inspiration.\n\n* [Ghost](https://ghost.org/) - check out the About page revenue info and [transparency](https://blog.ghost.org/tag/transparency/) blog posts\n* Wikipedia (Kaitin)","name":"2017-09-15-business-thinking","path":"/content/blog/2017-09-15-business-thinking","url":"/blog/2017-09-15-business-thinking","files":{},"pages":{}},"/blog/2017-09-15-human-tech":{"title":"Seeking Human-Sized Technology","visible":true,"draft":true,"date":"2017-09-15","view":"entry","text":"We've seen regularly in the last few months how tech aims to innovate without understand the human aspects of technology.\n\nThe extension of capitalism to web technology was inevitable. What started as a research project has become the source of tbhe world's largest fourtunes. It is only expected that the capitalist mindset would be mirrored in software design.\n\nFor those who skipped economics 101, rightly so, there is a large gap between economic models and the real world. Most economic models assume humans have perfect information and make decisions purely in economic terms. As economic models have moved to reflect the real world, the real world has also shifted towards economic models. To achieve a perfectly capitalism world we need less trust and human-driven differenetiation (things like location).\n\nBitcoin and blockchain are the most visisble instance of this shift. To achieve a pefect capitalist market (a libertarian dream) you need perfect information and no friction in transactions. And by creating trustless global markets we move a step in that direction.\n\nBlockchain technology takes humans out of the picture *by design*. There is idea of wet code versus dry code in the blockchain world. Wet code is humans. Is is messy and not perfect. Dry code is the opposite. Without trust, there is no reason to differentiate between equal competitors or build relationships. If I am trying to buy file storage, I want the cheapest price - there is no other constraint because all other factors have been guarenteed by the software (availablility, reliability, etc.). This makes social constructs, such as groups, communities, or trust useless. And that is the purpose, those are part of wet code.\n\n(warning: rant about capitalism ahead)\n\nTo achieve this level of capitalist prefection the market must be completely trustless. Bitcoin, for example, is an extension of pure capitalism. In capitalism, businesses relentlessly pursue increasing returns to scale. To lower production prices business seek the lowest paid labor, reduce expenses on non-essential things like healthcare, and advocate for less regulation and lower taxes.\n\nIn seeking capital accumulation, markets generally leverage increaing amounts of resource consumption. These resources could be human, as we saw in slavery-driven America, or natural resources.\n\nTrustless networks furthur enable this.\n\nwe need a system that still enables group collaboration. If everyone in a group trusts each other, there is no reason to get technologically more complex. Keep it human.\n\nwe need \"human sized technology\".\n\nfacebook, google, are also non human. network effect leads towards non-human solutions in order to monetize effectively. human requires it can work as well in small groups as large networks, without increasing returns to scale.\n\n**also similar to zebra startup idea** reference that at beginning\n\nhttps://medium.com/@sexandstartups/zebras-lets-get-in-formation-fdcbc72fec4a\nhttps://medium.com/@sexandstartups/zebrasfix-c467e55f9d96\n\nhttps://nytimes.com/2017/09/15/business/cryptocurrency-bubble-doge.html\nhttps://medium.com/humane-tech/toward-humane-tech-23a20405681a\nhttps://medium.com/humane-tech","name":"2017-09-15-human-tech","path":"/content/blog/2017-09-15-human-tech","url":"/blog/2017-09-15-human-tech","files":{},"pages":{}},"/blog/decision-making":{"title":"Nonprofit Leadership: Decision Making Fatigue","visible":true,"draft":true,"date":"2019-05-16","view":"entry","text":"Leaders everywhere face an overwhelming number of decisions. As leaders of nonprofits, we experience this like any other business leaders. However, we also face the extra burden of ensuring these decisions are made in the public interest, consistent with our mission, and often must do so with limited financial or personnel resources. As we grow as leaders, these decisions have a greater impact on a larger number of people.\n\nSo how can we effectively make these decisions? I've found a few practices especially helpful:\n\n* Reduce the number of decisions by making meta-decisions.\n* Make all decision making consistent with high-level values.\n* Practice reviewing decisions to understand why decisions are made.\n\nThese practices aim to make decision making less about specific decisions, which may be more emotionally or time dependent, to be more about making decisions based on your organizational or personal priorities.\n\n## Reduce the number of decisions\n\nThis practice is the easiest and perhaps most effective. Consider a decision you make regularly, such as: \"should I go to this conference or not?\". Our aim is to make this decision once and for all, so you never have to consider each individual case. We do this by creating a simple but effective set of questions that ensures each decision is in line with our priorities.\n\nFor each type of decision, we ask ourselves six questions. One set of three questions **must** all be yes and a second set must be yes for two out of three. For example, in our decisions around work travel we use the following questions:\n\n#### All Must Be Yes:\n\n*Answers to the questions must be yes for each decision.*\n\n* Are there essential relationships to build at this event?\n* Is this travel only during the week?\n* Is the schedule for that month clear of other travel?\n\nIf any of the answers are *No*, then our decision is made. In this case, we can also map these questions to some of our current priorities: relationship building, family, and reducing burnout.\n\n#### 2 of 3 must be yes:\n\n* Is travel paid for?\n* Are we getting paid for our time?\n* Are we speaking to a large audience?\n\n*This practice is from the book Essentialism: The Disciplined Pursuit of Less by Greg McKeown.*","name":"decision-making","path":"/content/blog/decision-making","url":"/blog/decision-making","files":{},"pages":{}},"/blog/open-source-licensing":{"title":"Learning About Open Source Licenses","date":"2018-07-05","view":"entry","visible":true,"draft":true,"text":"Copyright and licensing in open source software is both at the forefront and regularly ignored. As an independent open source developer, I have always been aware of licensing, licensed most my projects, but never involved in the practical issues of copyright enforcement. To me, licenses and copyright were a very static thing; there is a license file, a person owns the copyright, and there are *consequences* if not followed. But through attempting to enforce licensing terms, I've begun to understand licensing more as a tool and avenue for managing adoption (also perhaps political statement, but less so now).\n\n## A Practical Introduction: Attempting to enforce hundreds of copyrights\n\nUnfortunately, my introduction to licensing was forced by extensive copyright violations of [Dat Project](https://datproject.org) software. A person posted copies of all our core modules with new names on GitHub and npm while removing all licenses, mentions of the copyright owner, and anything referencing Dat Project or the sources. This person had said in chat rooms that he was creating a new project, a \"new distributed web\", had created hundreds of new modules and was slowly releasing them. Of course, that distributed web was Dat and Beaker Browser. All stuff he claimed to build was the work we've put in over the last five years. *(Folks who watch the Silicon Valley show may laugh at the parallels to the \"new Internet\" and \"new new Internet,\" an unfortunate reflection of the insidious culture of SV.)*\n\nMany of our projects use the MIT license. At just over 1000 characters, the MIT license reads relatively straight forward, especially this line:\n\n> The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nHowever, lots of questions come up in the application and how to actually enforce that. The short answer I've learned is it is basically impossible for a set of loosely organized, independent software developers to enforce their copyright for mass violations. A large part of this is because the offender, if they aren't a commercial entity, has little incentive to follow the copyright and the penalty for violations is essentially nonexistent.\n\nMost importantly, I've learned that in any licensing discussion there is a lot of nuance! You can register copyrights to strengthen the penalty, commercial entities have extra reason to be cautious, etc. But the bottom line is that independent developers have no viable or worthwhile course of action in copyright enforcement, especially for permissive licenses such as MIT.\n\n*(It's been hard for me to square this conclusion with my feeling of having an ethical imperative to minimize the unsavory use of my software. We've been especially concerned about Dat being used in cryptocurrency or related scams.)*\n\nFolks may complain that we shouldn't care if someone takes our work, since it is open source and that is the point. Something something transition.\n\n## The Burden of Open Source\n\nWhile I'm focusing this post on licensing, it is hard to say anything about licensing in open source without considering how licensing impacts how developers spend their time. Open source encourages adoption with minimal bureaucratic overhead. That lack of overhead has implications for who needs support and how sustainable a project is.\n\nToo much other good writing has been done on this topic to spend more time on it. But suffice to say, licensing can be a critical point of leverage in open source. Some other recommended background reading:\n\n* https://nadiaeghbal.com/oss/\n* https://www.fordfoundation.org/library/reports-and-studies/roads-and-bridges-the-unseen-labor-behind-our-digital-infrastructure/\n* L0 blog post\n\nThe critical point here is that permissive licensing has a range of negative impacts on the copyright holder (expectations of support, lack of viable enforcement, no financial support) while giving positive impacts to users, especially commercial organizations.\n\n## Moving Forward\n\nWhile I'm not going to relitigate the old argument about whether open source is good carte blanche, it is worth noting that the extremes of open source have drastically different implications for copyright holders and there is no nuance in current licensing approaches. Consider the two situations:\n\n1. Developer builds a fun project for themselves that other independent developers use for their own fun projects.\n2. Developer builds library that gets used by thousands of people at commercial organizations.\n\nIn the first situation, expectations are more clear, financial incentives are minimized, and support burden is relaxed. A developer in the second situation now has users with financial pressure (and benefits) which impact expectations and support requirements. However, licensing has very little gray area between permissive and financial ties with strong expectations.\n\nLooking at music distribution is an interesting thought exercise...\n\n## The Problem: Adoption vs Gainful Support\n\n\nA few key questions have surfaced in learning about licensing:\n\n* Who has the burden of proof?\n* Is there a credible threat of enforcement? What is the cost/penalty?\n* Where are the nuances, and who do they support?\n\n### Burden of Proof\n\nAny time you want to enforce your copyright, through your licensing terms, you must have some proof of wrongdoing. While platforms like YouTube have made this hurdle especially low for large commercial entities like record labels, my experience was not the same.\n\n### Impact of Enforcement\n\n\n### License Nuances\n\n\n---\n\n## Expectations\n\n* Am I paying you for this license for work completed?\n* How do I pay for ongoing support?\n\n\n## Licensing & Copyright\n\n* The credible threat of enforcement\n* DMCA headaches\n* Licensing management as an individual","name":"open-source-licensing","path":"/content/blog/open-source-licensing","url":"/blog/open-source-licensing","files":{},"pages":{}},"/blog/open-source-licensing-part2":{"title":"Learning About Open Source Licenses Part 2 (Featuring License Zero)","date":"2018-07-06","view":"entry","visible":true,"draft":true,"text":"## License Zero\n\n*Gainful software in the open*\n\n### Why I like License Zero\n\n* Make expectations around commercial use transparent.\n\n\n### Problems\n\n* Assumption that you can use open source work\n* Disconnect between developers and legal teams in commercial companies\n* Downstream users (not using the immediate package)\n\n\n## Systemic Problems\n\n* We are trying to solve it from the abused party, not going to work.\n* Needs culture change within institutions using open source (especially academic institutions)\n\n\nhttps://licensezero.com/ids/0153a099-6acd-4023-8a96-9d81d9969a58/\n\n\nResources:\n\n* https://guide.licensezero.com\n* https://www.npmjs.com/package/licensee","name":"open-source-licensing-part2","path":"/content/blog/open-source-licensing-part2","url":"/blog/open-source-licensing-part2","files":{},"pages":{}},"/books":{"title":"Books","visible":true,"view":"page","text":"Currently Reading:\n\n* [The Attention Merchants: The Epic Scramble to Get Inside Our Heads](https://www.goodreads.com/book/show/32674176-the-attention-merchants) by Tim Wu\n* The Hero with a Thousand Faces\n\n## 2018\n\nRead in 2018 ([goodreads](https://www.goodreads.com/user/show/3653103-joe)):\n\n* Taking the Leap: Freeing Ourselves from Old Habits and Fears, by Pema Chödrön\n* The Stone Sky (The Broken Earth, #3), by N.K. Jemisin\n* The Book on the Taboo Against Knowing Who You Are, by Alan W. Watts\n* God Help the Child, by Toni Morrison\n* The Obelisk Gate (The Broken Earth, #2), by  N.K. Jemisin\n* Thinking in Systems: A Primer, by Donella H. Meadows\n* A Little Life, by Hanya Yanagihara\n* Making Sense of People: Decoding the Mysteries of Personality, by Samuel H. Barondes\n* Null States, by Malka Ann Older\n* 13 Things Mentally Strong People Don't Do: Take Back Your Power, Embrace Change, Face Your Fears, and Train Your Brain for Happiness and Success, by Amy Morin\n* Mastery: The Keys to Success and Long-Term Fulfillment, by George Leonard\n* What I Talk About When I Talk About Running, by Haruki Murakami\n* [Twitter and Tear Gas: The Power and Fragility of Networked Protest](https://www.twitterandteargas.org/), by Zeynep Tufekci\n* *The Fifth Season (Broken Earth #1)*, by N.K. Jesmin\n* *Norwegian Wood*, by Haruki Murakami\n* *Feeling Good: The New Mood Therapy* by David D. Burns\n* *The Passion Trap* by Delis, Dean C.\n* *Fire and Fury: Inside the Trump White House* by Wolff, Michael\n\n## 2017\n\nBooks I read in 2017:\n\n* *The Art of Fear: Why Conquering Fear Won't Work and What to Do Instead* by Ulmer, Kristen\n* *The Upward Spiral: Using Neuroscience to Reverse the Course of Depression, One Small Change at a Time* by Korb, Alex\n* *Cure: A Journey into the Science of Mind Over Body* by Marchant, Jo\n* *Daring Greatly: How the Courage to Be Vulnerable Transforms the Way We Live, Love, Parent, and Lead* by Brené Brown\n* *The Gifts of Imperfection: Let Go of Who You Think You're Supposed to Be and Embrace Who You Are* by Brené Brown\n* *Leonardo da Vinci* by Walter Isaacson\n* *All About Love: New Visions* by bell hooks\n* [The Lessons of History](https://www.goodreads.com/book/show/174713.The_Lessons_of_History) by Will & Ariel Durant\n* [The Will to Change: Men, Masculinity, and Love](https://www.goodreads.com/book/show/6656720-the-will-to-change) by bell hooks\n* [Principles](https://www.goodreads.com/book/show/12935037-principles) by Ray Dalio\n* [The Effective Executive: The Definitive Guide to Getting the Right Things Done](https://www.goodreads.com/book/show/48019.The_Effective_Executive) by Peter F. Drucker\n* [Small Giants: Companies That Choose to Be Great Instead of Big](https://www.goodreads.com/book/show/32570493-small-giants) by Bo Burlingham\n* [The Magic of Thinking Big](https://www.goodreads.com/book/show/23658680-the-magic-of-thinking-big) by David J. Schwartz\n* [Growth Hacker Marketing: A Primer on the Future of PR, Marketing, and Advertising](https://www.goodreads.com/book/show/18454317-growth-hacker-marketing) by Ryan Holiday\n* [Blue Ocean Strategy: How To Create Uncontested Market Space And Make The Competition Irrelevant](https://www.goodreads.com/book/show/4898.Blue_Ocean_Strategy) by W. Chan Kim, Renée Mauborgne\n* [We Should All Be Feminists](https://www.goodreads.com/book/show/22738563-we-should-all-be-feminists) by Chimamanda Ngozi Adichie\n* [Tribe: On Homecoming and Belonging](https://www.goodreads.com/book/show/29495839-tribe) by Sebastian Junger\n* [Radical Acceptance: Embracing Your Life With the Heart of a Buddha](https://www.goodreads.com/book/show/173666.Radical_Acceptance) by Tara Brach\n* [The Meaning of Human Existence](https://www.goodreads.com/review/list/3653103-joe?utf8=%E2%9C%93&shelf=read&title=joe&per_page=75) by Edward O. Wilson\n* [Ego Is the Enemy](https://www.goodreads.com/book/show/29428533-ego-is-the-enemy) by Ryan Holiday\n* [How will capitalism end?](https://www.goodreads.com/book/show/25733863-how-will-capitalism-end-essays-on-a-failing-system) by Wolfgang Streeck\n* [The \"S\" word: A Short History of an American Tradition... Socialism](https://www.goodreads.com/book/show/26109262-the-s-word) by John Nichols\n* [Positive Computing: Technology for Wellbeing and Human Potential](https://www.goodreads.com/book/show/22104595-positive-computing) by Rafael A. Calvo, Dorian Peters\n* [Inventing the Future: Postcapitalism and a World Without Work](https://www.goodreads.com/book/show/25387807-inventing-the-future) by Nick Srnicek, Alex Williams\n* [Thinking the Twentieth Century](https://www.goodreads.com/book/show/12383405-thinking-the-twentieth-century) by Tony Judt, Timothy Snyder\n\n### Fiction\n\n* [Too Like the Lightning](https://www.goodreads.com/book/show/26114545-too-like-the-lightning) (Terra Ignota #1) by Ada Palmer\n* [The Wind-Up Bird Chronicle](https://www.goodreads.com/book/show/8872524-the-wind-up-bird-chronicle) by Haruki Murakami\n* [Kafka on the Shore](https://www.goodreads.com/book/show/4929.Kafka_on_the_Shore) by Haruki Murakami\n* [Station Eleven](https://www.goodreads.com/book/show/21792828-station-eleven) by Emily St. John Mandel\n* [Walkaway](https://www.goodreads.com/book/show/30299451-walkaway) by Cory Doctorow\n* [Binti](https://www.goodreads.com/book/show/25667918-binti)  (Binti, #1) by Nnedi Okorafor\n* [The Lathe of Heaven](https://www.goodreads.com/book/show/22007410-the-lathe-of-heaven) by Ursula K. Le Guin\n* [The Liberation](https://www.goodreads.com/book/show/28962883-the-liberation) by Ian Tregillis by - Loved the Alchemy Wars series.\n* [The Word for World is Forest](https://www.goodreads.com/book/show/8580931-the-word-for-world-is-forest) by Ursula Le Guin\n* [Hyperion](https://www.goodreads.com/book/show/10240738-hyperion), [Fall of Hyperion](https://www.goodreads.com/book/show/10429950-the-fall-of-hyperion), Endymion, and The Rise of Endymoin by Dan Simmons\n* [Expanse #5, #6](https://www.goodreads.com/series/56399-the-expanse) by James S.A. Corey\n\n## 2016 in Books\n\n* [The Art of Mindfulness](https://www.goodreads.com/book/show/12561666-the-art-of-mindfulness) - Thich Nhat Hanh\n* [Gratitude](https://www.goodreads.com/book/show/27391727-gratitude) - Oliver Sacks\n* [The Next Revolution](https://www.goodreads.com/book/show/21972006-the-next-revolution) - Murray Bookchin\n* [Rules for Revolutionaries](https://www.goodreads.com/book/show/32940408-rules-for-revolutionaries) - Becky Bond & Zack Exley\n* [Infomocracy](https://www.goodreads.com/book/show/26114433-infomocracy) - Malka Ann Older\n* [Originals](https://www.goodreads.com/book/show/25947237-originals) - Adam Grand\n* [The Dispossessed](https://www.goodreads.com/book/show/6602919-the-dispossessed) Ursula Le Guin\n* [The Expanse Series](https://www.goodreads.com/series/56399-the-expanse) (Books 1,2,3,4) - James S.A. Corey\n* [23 Things They Don’t Tell You About Capitalism](https://www.goodreads.com/book/show/10219794-twenty-three-things-they-don-t-tell-you-about-capitalism) - Ha-Joon Chang\n* [Bad Samaritans](https://www.goodreads.com/book/show/13337894-bad-samaritans) - Ha-Joon Chang\n* [The Conquest of Bread](https://www.goodreads.com/book/show/1113155.The_Conquest_of_Bread) - Peter Kropotkin\n* [Imperial Radch Series](https://www.goodreads.com/series/113751-imperial-radch) - Ann Leckie\n* [Rising Strong](https://www.goodreads.com/book/show/23317538-rising-strong) - Brené Brown\n* [Still the Mind](https://www.goodreads.com/book/show/60548.Still_the_Mind) - Alan Watts\n* [Armada](https://www.goodreads.com/book/show/16278318-armada) - Ernest Cline\n* [Cleopatra](https://www.goodreads.com/book/show/7968243-cleopatra) - Stacy Shiff\n* [The Circle](https://www.goodreads.com/book/show/18302455-the-circle) - Dave Eggers\n* [Class: A Guide Through the American Status System](https://www.goodreads.com/book/show/60044.Class) - Paul Fussell\n* [A Fighting Chance](https://www.goodreads.com/book/show/18779662-a-fighting-chance) - Elizabeth Warren\n* [Rights of Man, Common Sense](https://www.goodreads.com/book/show/177524.Rights_of_Man_Common_Sense_and_Other_Political_Writings) - Thomas Paine\n* [The Ecology of Freedom](https://www.goodreads.com/book/show/312960.The_Ecology_of_Freedom) - Murray Bookchin\n* [If The Buddha Dated](https://www.goodreads.com/book/show/209575.If_the_Buddha_Dated) - Charlotte Kasl\n* [Rebel Cities](https://www.goodreads.com/book/show/13095855-rebel-cities) - David Harvey\n* [Moral Mazes](https://www.goodreads.com/book/show/279812.Moral_Mazes) - Robert Jackall\n* [The Inevitable](https://www.goodreads.com/book/show/27209431-the-inevitable) - Kevin Kelly\n* [The Idealist](https://www.goodreads.com/book/show/23492684-the-idealist) - Justin Peters\n* [The Rising](https://www.goodreads.com/book/show/25318815-the-rising) & [The Mechanical](https://www.goodreads.com/book/show/20980667-the-mechanical) - Ian Trellis\n* [When Breath Becomes Air](https://www.goodreads.com/book/show/25614898-when-breath-becomes-air) - Paul Kalanithi\n* [This is How](https://www.goodreads.com/book/show/13167087-this-is-how) - Augusten Burroughs\n* [Mistborn: Secret History](https://www.goodreads.com/book/show/28698036-secret-history) - Brandon Sanderson\n* [The Emperor’s Soul](https://www.goodreads.com/book/show/13578175-the-emperor-s-soul) - Brandon Sanderson\n* [The Bands of Mourning](https://www.goodreads.com/book/show/18739426-the-bands-of-mourning)\n* [The Big Short](https://www.goodreads.com/book/show/26889576-the-big-short) - Michael Lewis\n* [Born for This](https://www.goodreads.com/book/show/25893428-born-for-this) - Chris Guillebeau\n* [The Democracy Project](https://www.goodreads.com/book/show/13330433-the-democracy-project) - David Grabber\n* [Behind the Beautiful Forevers](https://www.goodreads.com/book/show/11869272-behind-the-beautiful-forevers) - Katherine Boo\n* [The Utopia of Rules](https://www.goodreads.com/book/show/22245334-the-utopia-of-rules) - David Graeber\n* [River of Stars](https://www.goodreads.com/book/show/11869272-behind-the-beautiful-forevers) - Guy Gavriel Kay\n* [Flash Boys](https://www.goodreads.com/book/show/24724602-flash-boys) - Michael Lewis\n* [Debt: The First 5000 Years](https://www.goodreads.com/book/show/6617037-debt) - David Graeber","name":"books","path":"/content/books","url":"/books","files":{},"pages":{}},"/cookies":{"title":"Making the Best Cookies","nav":false,"visible":true,"view":"page","text":"Let's get the obvious out of the way first. Chocolate chip cookies are the best cookies. So if we can make the best chocolate chip cookies, then we can make the best cookies.\n\nMaking cookies is mostly a science. Once you get the scientific part down, a little bit of practice makes perfect. These cookies are so good they were [tested experimentally](https://bikeportland.org/2011/07/01/solution-for-ladd-circle-stop-sign-issue-cookies-55819) as a replacement for stop signs.\n\nSo, how do you make the best cookies in the world? Follow these instructions, practice, get to know your oven, and then check out the advanced tips at the bottom.\n\n![Cookie Dough](cookie_dough.jpg \"Dough Prepared for Oven (Credit:Joe Hand)\")\n\n*Definitely do not bake your cookies this close together*\n\n### Chocolate Chip Cookies\n\nFollow the directions, make yummy cookies, and share them with your friends.\n\n#### Ingredients (double or triple as necessary):\n\n * 2 Cups Flour\n * 1/2 tsp Sea Salt\n * 1/2 tsp Baking Soda\n * 1 c Brown Sugar\n * 1/2 c White Sugar\n * 3/4 c Butter\n * 1 egg\n * 1 egg yolk\n * 1 tbsp vanilla\n\n##### Tools\n\n* Two large mixing bowls\n* Cup + spoon measuring devices\n* Oven\n* Baking Sheet\n* Silicon Baking Mat (optional)\n* Kitchen Scale (optional)\n\n#### Directions\n\n1. Start by getting all of your ingredients out in one place. That way you will not forget anything. Put things away after each step and make cleaning so much easier!\n2. Mix dry stuff in bowl, set aside.\n * 2 Cups Flour\n * 1/2 tsp Sea Salt\n * 1/2 tsp Baking Soda\n3. Mix sugars and butter in new bowl. Melted butter is easier but changes how dough bakes (__see advanced tips__). Make sure it all gets mixed well.\n * 1 c Brown Sugar\n * 1/2 c White Sugar\n * 3/4 c Butter\n4. Add eggs and vanilla to sugar + butter and mix well.\n * 1 egg\n * 1 egg yolk\n * 1 tbsp vanilla\n5. Add dry stuff into wet about 1/2 cup at a time and fold it with a gentle force.\n6. Add chocolate chips (about 1 cup but really a personal preference here).\n7. Place on cookie sheet. Make whatever size you want.\n8. Bake at 325 for 12ish minutes, until edges are browned.\n8. Remove from oven and let sit on cookie sheets for 5 minutes. Move to wire rack for 5 more minutes.\n9. Eat!!!\n\n![Cookies](cookies_med.jpg \"Cookies! (Credit:Joe Hand)\")\n\nEver since I can remember I made Chocolate Chip Cookies. In high school I discovered a recipe I really liked, memorized it, and spent the next ten years experimenting on slight variations.\n\nAfter college I really wanted to start a business making cookies. My plan was to strap a little oven on a bike trailer and go to the people. Who doesn't want a cookie that was freshed baked in front of them? Unfortunately, I got a real job.\n\n**The real secret is not what you put in the cookies, but how you make them. So be sure to add lots of love!**\n\n## Advanced Notes\n\nWant extra good cookies? Follow some or all of these advanced tips to get better cookies.\n\n#### While Making\n\n* Use a kitchen scale to weight the flour.\n* Sift the flour with salt, baking soda before adding to sugar/butter.\n* Let sugar and melted butter sit in fridge for ~30 minutes after mixing.\n\n####  Dough\n\n* The cookies are better if you wait a day or two to bake them! Let all the yummy sugar and fat work its magic.\n* Put the dough wrapped in plastic or tightly covered for 24-48hrs. I unusually do this with at least half the dough whenever I make cookies.\n* Freezing the dough works too! Let thaw in fridge overnight before baking.\n* Take it out of the fridge 30 min before you plan on baking the cookies.\n\n#### Baking\n\n* Good cookie sheets are worth it.\n* [This baking sheet](http://amzn.to/2wZmgTH) is the best.\n* [This baking sheet](http://amzn.to/2wri2Tt) is good and more forgiving.\n* Get a [silicon baking mat](http://amzn.to/2wueLAR) to bake on.\n\n#### Post Bake\n\n* They are good to eat after 5 min of cooling on a wire rack!\n* They are also still very good later! If you are storing them overnight, be sure to put them in a sealed bag or Tupperware.\n\n#### About Those Chocolate Chips\n\n* This is really a personal preference, both in quantity and quality. As long as you do not go overboard with too many chips, the cookies will turn out good.\n* I like the larger bittersweet type chocolate chips. There used to be a brand I liked the most but I forgot. It's probably in my experiment notebook somewhere.\n\nGood luck and enjoy the cookies!\n\n---\n\n## Secret Sauce\n\nOkay, you really want to make the best? Here is the super secret step by step instructions. Follow this *exactly* for the best experience. Tell everyone.\n\n#### *Prerequisite*\n\nMake the cookies above a few times. Mistakes are good! That is how we learn. Getting down your oven timing requires some practice.\n\n#### Dough Preparation\n\n1. Get all your ingredients out . Use double the recipe above.\n2. Melt butter on stove or oven. Do not burn! Low temperature.\n3. Measure flour on scale (very important to get exact weight) and add to flour sifter.\n4. Add baking soda and salt to sifter.\n5. Sift the flour into a clean, dry bowl! Cover the bowl with towel.\n6. Combine brown sugar and white sugar.\n7. Add melted butter (a few little un-melted chunks are ok)\n8. Stir stir stir! We really want to mix the fat and sugar.\n9. Set sugar + butter in fridge for 30 minutes.\n10. (30 minutes later) Remove sugar + butter from fridge.\n11. Add eggs, yolks, and vanilla into sugar + butter (room temperature is best, thats why you get them out at the start). Stir stir stir!\n12. Introduce a bit of flour (~1/2 cup) to the sugar mix and stir.\n13. Continue to add flour about ~1 cup at a time and stir with folding motion (see [this video](https://www.youtube.com/watch?v=jXe-kTlTv8I) for pointers).\n14. Take a break! Stirring this much dough is hard.\n14. After most white specs are gone, start adding chocolate chips!\n15. Add about ~3/4 cup at a time until to your liking.\n16. Make dough into a big round ball (or 2 smaller ones). Fun (also fun)!\n\n#### Waiting\n\n1. Cover dough tightly with plastic wrap and place in sealed container.\n2. Put dough in fridge for exactly 36 hours. Or more than 24 hrs and less than 40.\n\n#### Baking\n\n1. Remove dough from fridge 30 minutes before baking.\n2. Turn oven to 325. Have thermometer inside to verify temperature.\n3. Use [ice cream scoop with lever](http://amzn.to/2ewt57I) to ball cookies into 2-1/4 inch scoops. Adding some flour to scooper helps.\n4. Put cookie dough on silicon baking mat on [this baking sheet](http://amzn.to/2wZmgTH).\n5. Place cookies on over rack 1/3 up from bottom.\n6. After 6 minutes, move to shelf closer to top.\n7. Remove cookies when *just* browned on visible edges. Bake cookies for approximately 12 minutes total.\n8. Remove and let sit on baking sheet for 5 minutes.\n9. Move to wire rack to cool another 5 minutes.\n10. Savor your delicious cookie and melted chocolate.\n11. Store extras in sealed container. They are still yummy and chewy a few days later! (They dry out after about 36 hours)\n\nWhen I put it that way it sounds very tedious. But for me it is a meditation. Enjoy your cookies!\n\n-Joe","name":"cookies","path":"/content/cookies","url":"/cookies","files":{"cookie_dough.jpg":{"name":"cookie_dough","path":"/content/cookies/cookie_dough.jpg","url":"/cookies/cookie_dough.jpg","source":"/content/cookies/cookie_dough.jpg","extension":".jpg","filename":"cookie_dough.jpg","type":"image"},"cookies_med.jpg":{"name":"cookies_med","path":"/content/cookies/cookies_med.jpg","url":"/cookies/cookies_med.jpg","source":"/content/cookies/cookies_med.jpg","extension":".jpg","filename":"cookies_med.jpg","type":"image"}},"pages":{}},"/notes":{"title":"Notes","view":"notes","text":"*Collections of short notes, interesting links, and fun. For your curiosity.*","name":"notes","path":"/content/notes","url":"/notes","files":{},"pages":{"foundation":{"name":"foundation","path":"/content/notes/foundation","url":"/notes/foundation","source":"/content/notes/foundation"},"gf-cookies":{"name":"gf-cookies","path":"/content/notes/gf-cookies","url":"/notes/gf-cookies","source":"/content/notes/gf-cookies"},"os-broken":{"name":"os-broken","path":"/content/notes/os-broken","url":"/notes/os-broken","source":"/content/notes/os-broken"},"random":{"name":"random","path":"/content/notes/random","url":"/notes/random","source":"/content/notes/random"},"web-lost":{"name":"web-lost","path":"/content/notes/web-lost","url":"/notes/web-lost","source":"/content/notes/web-lost"}}},"/notes/foundation":{"date":"2019-02-04","theme":"health","text":"I found [Foundation Training](https://www.foundationtraining.com/) recently and have been loving it. The movements are similar to yoga but focus on the posterior change and other hip connectors. Though quite advanced (definitely learn the decompression breath first!), [this 12 minute workout](https://www.youtube.com/watch?v=4BOTvaRaDjI) is a great demonstration of the moves.\n\n[Decompression breathing](https://www.youtube.com/watch?v=mGv4T_Q4dGA) is one of the core ideas. While similar to other breathing practices, I found the trick of using your hand to measure your breath very helpful!\n\nI've started doing the foundation exercises in the book True to Form regularly. The goal is to do the moves 6 times per week, doing 6-7 different moves on alternating days. Unfortunately, I cannot recommend the book. Just not very good. Get it from your library and just follow the daily exercises =).","visible":true,"view":"entry","name":"foundation","path":"/content/notes/foundation","url":"/notes/foundation","files":{},"pages":{}},"/notes/gf-cookies":{"date":"2018-07-23","theme":"random","text":"### Gluten Free Chocolate Chip Cookies\n\nI've been experimenting with gluten free chocolate chip cookies, based on my [perfect cookie recipe](/cookies). There is a lot to learn, but the main struggles so far are making sure the cookies stay together and are not too dry. To start, I've been using Bob's Red Mill all purpose gluten free flour, which is a good all purpose gf flour!\n\nA few tips so far:\n\n* Much easier to make small cookies. They stay together better and seem to keep more moisture.\n* They go very quickly from done to too try, you need to watch closely and take them out before they look ready. Then give them some time to cook on the hot sheet.\n* I usually use butter directly on the cookie pan, but the cookies seemed to be spreading too much. Using parchment paper has helped to avoid too much spread.\n* 24-48hrs in fridge helps a lot!\n* Ghee! I tried using ghee instead of butter out of curiosity. The cookies were a lot more moist and pretty great. You wouldn't know they were gluten free. I was worried the ghee taste would come through too much but it was a nice mellow nutty flavor.\n\nThe last batch was pretty great, I may continue to experiment with different flours but quite happy with where I am:\n\n* 325g Bob's Red Mill Gluten Free 1-for-1 all purpose\n* 1/2 tsp salt\n* 1/2 tsp baking soda\n* 1 cup brown sugar\n* 1/2 cup white sugar\n* 3/4 cup ghee\n* 1 egg + 1 egg yolk\n* 1 tbsp vanilla\n* chocolate chips\n\nBake at 325 for ~11 minutes. Cool on sheet for 5 minutes, then move to wire rack.\n\nEnjoy!","visible":true,"view":"entry","name":"gf-cookies","path":"/content/notes/gf-cookies","url":"/notes/gf-cookies","files":{},"pages":{}},"/notes/os-broken":{"name":"os-broken","path":"/content/notes/os-broken","url":"/notes/os-broken","files":{},"pages":{}},"/notes/random":{"date":"2018-07-04","theme":"random","text":"This is start of my notes page! I use [Pocket](https://getpocket.com/@joeahand) to read articles and [Tweet](https://twitter.com/joeahand) about especially interesting finds. This is something between that and my blog. Goal, use a RSS reader on Dat so I can share my feed.","visible":true,"view":"entry","name":"random","path":"/content/notes/random","url":"/notes/random","files":{},"pages":{}},"/notes/web-lost":{"visible":true,"theme":"technology","view":"entry","date":"2017-10-01","text":"*The Web We Lost*\n\n* https://twitter.com/anildash/status/723201129220284416\n* https://www.youtube.com/watch?v=9KKMnoTTHJk\n* https://blog.mozilla.org/internetcitizen/2017/07/27/434/","name":"web-lost","path":"/content/notes/web-lost","url":"/notes/web-lost","files":{},"pages":{}},"/now":{"title":"Now","visible":true,"view":"page","text":"<span class=\"f7 avenir\">*(This is my now page, letting you know what I am doing now. [The idea](http://nownownow.com/about) was inspired by Derek Sivers.)*</span>\n\n* **Work** Co-Executive Director of [Code for Science & Society](https://codeforscience.org) with [Danielle Robinson, PhD](http://www.daniellecrobinson.com/)!\n* **Code** Recent things I've coded on: [Dat](https://datproject.org), neat-log, message.land.\n* **Books** Lots of Octavia Butler!\n* Keeping things brief.\n\n\n\n*Last updated: 4th Feb 2019.*","name":"now","path":"/content/now","url":"/now","files":{},"pages":{}},"/":{"title":"jhand.space","view":"home","links":{"notes":{"title":"Notes","url":"/notes"},"books":{"title":"Books I am Reading","url":"/books"},"cookies":{"title":"Making the Best Chocolate Chip Cookies","url":"/cookies"},"css":{"title":"Code for Science & Society","url":"https://codeforscience.org"},"dat":{"title":"Dat Project","url":"https://datproject.org"}},"text":"Hello! I am Joe, a purveyor of mediocre Hand-related jokes. I work at the intersection of communities and technology to address structural problems. Currently, I am Co-Executive Director of <a href=\"https://codeforscience.org\" class=\"washed-red fw5 link dim\">Code for Science & Society</a> and a core developer on <a href=\"https://datproject.org\" class=\"washed-red fw5 link dim\">Dat Project</a>.\n\nFind out what I am doing <a href=\"/now/\" class=\"washed-red fw5 link dim\">now</a>. Have a sweet tooth? Learn how to make the <a href=\"/cookies/\" class=\"washed-red fw5 link dim\">best cookies</a> in the world. Support public data, <a href=\"http://donate.datproject.org\" target=\"_blank\" class=\"washed-red fw5 link dim\">donate</a> to Dat Project.","name":"content","path":"/content","url":"/","files":{},"pages":{"blog":{"name":"blog","path":"/content/blog","url":"/blog","source":"/content/blog"},"books":{"name":"books","path":"/content/books","url":"/books","source":"/content/books"},"cookies":{"name":"cookies","path":"/content/cookies","url":"/cookies","source":"/content/cookies"},"notes":{"name":"notes","path":"/content/notes","url":"/notes","source":"/content/notes"},"now":{"name":"now","path":"/content/now","url":"/now","source":"/content/now"}}}}